Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId2
Category id of the second assembly member
Since:
2012

Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId1
Category id of the first assembly member
Since:
2012

Autodesk.Revit.DB.AssemblyMemberDifferentCategory
The two assembly members being compared have different category
Since:
2012